In [1]:
import os
os.getcwd()

'/home/anubratadas/circos-0.69-9'

In [2]:
import numpy as np
import pandas as pd

In [3]:
data=pd.read_csv('test2',sep='\t',header=None)
data.head()

      0        1        2     3
0  sal1  1347512  1348112  15.0
1  sal1  4180506  4180762   4.0
2  sal1  3170619  3171658  22.0
3  sal1  1031629  1033350   7.0
4  sal1   288230   288811  10.0

In [8]:
data.isnull().sum()

0    0
1    0
2    0
3    4
dtype: int64

In [24]:
data.head()

      0        1        2     3
0  sal1  1347512  1348112  15.0
1  sal1  4180506  4180762   4.0
2  sal1  3170619  3171658  22.0
3  sal1  1031629  1033350   7.0
4  sal1   288230   288811  10.0

In [46]:
data[data.iloc[:,3].isnull()]

         0        1        2   3
424   sal1  2961770  2962954 NaN
559   sal1  2051210  2051592 NaN
855   sal1  4108972  4110614 NaN
1845  sal1   318674   319165 NaN

In [52]:
newdata=np.where(data.isnull(),0,data)

In [61]:
newdata=pd.DataFrame(newdata)
newdata.isnull().sum()

0    0
1    0
2    0
3    0
dtype: int64

In [39]:
data=data.replace(np.NaN,0)
data.head()

      0        1        2     3
0  chr1  1347512  1348112  15.0
1  chr1  4180506  4180762   4.0
2  chr1  3170619  3171658  22.0
3  chr1  1031629  1033350   7.0
4  chr1   288230   288811  10.0

In [6]:
scaler=MinMaxScaler()

In [8]:
data[[3]]=scaler.fit_transform(data[[3]])

In [9]:
data.head()

      0        1        2         3
0  chr1  1347512  1348112  0.086705
1  chr1  4180506  4180762  0.023121
2  chr1  3170619  3171658  0.127168
3  chr1  1031629  1033350  0.040462
4  chr1   288230   288811  0.057803

In [62]:
newdata.to_csv('sal_mut_hist_int',sep='\t',header=False,index=False)